package com.example.textsummarizer.summarizer;

public class Demodriver {
    public static void main(String[] args) {
        SummarizerStartingPoint.getInstance().driver(" একটি রাষ্ট্র। দেশটির উত্তর, পূর্ব ও পশ্চিম সীমানায় ভারত ও দক্ষিণ-পূর্ব সীমানায় মায়ানমার; দক্ষিণে বঙ্গোপসাগর। সাবেক “বঙ্গ” বা “বাংলা” নামক ভূখন্ডের পূর্ব অংশ যা পূর্ব বাংলা নামে পরিচিত ছিল সেটি বর্তমান বাংলাদেশ রাষ্ট্র। সুপ্রাচীন কালে বাংলাদেশে প্রথম মানব বসতি গড়ে উঠে। পর্যায়ক্রমে বৌদ্ধ, হিন্দু ও মুসলিম শাসনের পর বাংলা ব্রিটিশ উপনিবেশে পরিণত হয়। আন্দোলনের ধারাবাহিকতায় ১৯৪৭ সালের ভারত বিভাগের সময় পাকিস্তানের পূর্ব অংশ (পূর্ব পাকিস্তান) হিসেবে বাংলাদেশের সীমানা নির্ধারিত হয়।");
    }
}
